stress-test.yaml
config:
  target: "http://ms.wcag-code-sniffer-scanner.reciteme.local/api/v1/scan/create"
  processor: "./get-random-url.js"
  phases:
    - duration: 15
      arrivalRate: 50

environments:
  - name: "development"

scenarios:
  - name: "Create Scan"
    flow:
      - function: "getRandomUrl"
      - post:
          url: "http://ms.wcag-code-sniffer-scanner.reciteme.local/api/v1/scan/create"
          json:
            callback: "http://localhost:3000/scan-results"
            job_id: "1"
            payload:
              scan_id: "random-uuid"
              tests: []
              scan_url: "{{ scan_url}}"
              level: 3