stress-test.yaml
config:
  target: "http://ms.wcag-axe-scanner.reciteme.local/api/v1/scan/create"
  processor: "./get-random-url.js"
  phases:
    - duration: 1
      arrivalRate: 12
  # defaults:
  #     headers:
  #         authorization: ""
    # - duration: 6
    #   arrivalRate: 0
    # - duration: 15
    #   arrivalRate: 1  

environments:
  - name: "development"

scenarios:
  - name: "Create Scan"
    flow:
      - function: "getRandomUrl"
      - post:
          url: "http://ms.wcag-axe-scanner.reciteme.local/api/v1/scan/create"
          json:
            callback: "http://localhost:3001/scan-results"
            job_id: "1"
            payload:
              tests: []
              scan_url: "{{ scan_url}}"